<?php

return [
    'cancel'                => 'إلغاء',
    'confirm_btn'           => 'تأكيد',
    'submit'                => 'إرسال',
    'ok'                    => 'موافق',
    'yes'                   => 'نعم',
    'no'                    => 'لا',
    'confirm'               => [
        'base'              => [
            'title'         => 'هل أنت متأكد؟',
            'desc'          => 'لن تتمكن من التراجع عن هذا!',
        ],
        'logout'            => [
            'title'         => 'هل أنت متأكد أنك تريد تسجيل الخروج؟',
            'desc'          => '',
            'confirm_btn'   => 'تسجيل الخروج',
        ],
        'exit'              => [
            'title'         => 'هل أنت متأكد؟',
            'desc'          => 'هل أنت متأكد من رغبتك في الخروج دون حفظ التغييرات؟ إذا قمت بذلك، فستفقد جميع التعديلات الأخيرة.',
            'confirm_btn'   => 'الخروج',
        ],
    ],
];
