<?php

return [
    'base_crud'                     => [
        'title'                     => [
            'label'                 => 'العنوان',
            'placeholder'           => 'الرجاء إدخال العنوان',
            'help'                  => 'أدخل العنوان (مطلوب)',
        ],
        'name'                      => [
            'label'                 => 'الاسم',
            'placeholder'           => 'الرجاء إدخال الاسم',
            'help'                  => 'أدخل الاسم (مطلوب)',
        ],
        'description'               => [
            'label'                 => 'الشرح',
            'placeholder'           => 'الرجاء إدخال الشرح',
            'help'                  => 'أدخل الشرح',
        ],
        'long_description'          => [
            'label'                 => 'شرح عام',
            'placeholder'           => 'الرجاء إدخال شرح عام',
            'help'                  => 'أدخل شرح عام',
            'subText'               => 'قم بتعيين شرح عام لتحسين الرؤية العامة للمحتوى',
        ],
        'email'                     => [
            'label'                 => 'البريد الإلكتروني',
            'placeholder'           => 'يرجى إدخال البريد الإلكتروني',
            'help'                  => '',
        ],
        'current_password'          => [
            'label'                 => 'كلمة المرور الحالية',
            'placeholder'           => 'كلمة المرور الحالية',
            'help'                  => 'الرجاء إدخال كلمة المرور الحالية',
        ],
        'password'                  => [
            'label'                 => 'كلمة المرور',
            'placeholder'           => 'كلمة المرور',
            'help'                  => 'يجب أن تكون كلمة المرور طولها 8 أحرف على الأقل وتحتوي على حرف كبير واحد وحرف صغير واحد ورقم واحد وحرف خاص واحد. مثال: Abc@1234',
        ],
        'password_confirmation'      => [
            'label'                 => 'تأكيد كلمة المرور',
            'placeholder'           => 'تأكيد كلمة المرور',
            'help'                  => 'الرجاء إدخال نفس كلمة المرور أعلاه',
        ],
        'image'                     => [
            'label'                 => 'الصورة',
            'placeholder'           => 'الرجاء تحديد صورة',
            'help'                  => 'حدد صورة',
            'subText'               => 'الانواع المسموح بها : :types والحجم الأقصى : :size MB',
        ],
        'image_lang'                => [
            'label'                 => 'الصورة [:locale]',
            'placeholder'           => 'الرجاء تحديد صورة [:locale]',
            'help'                  => 'حدد صورة [:locale]',
            'subText'               => 'الانواع المسموح بها : :types والحجم الأقصى : :size MB',
        ],
        'status'                    => [
            'label'                 => 'الحالة',
            'placeholder'           => 'الرجاء تحديد الحالة',
            'help'                  => 'حدد الحالة (مطلوب)',
        ],
        'lang'                      => [
            'label'                 => 'اللغة',
            'placeholder'           => 'الرجاء تحديد اللغة',
            'help'                  => 'حدد اللغة (مطلوب)',
        ],
        'date_range'                => [
            'label'                 => 'نطاق التاريخ',
            'placeholder'           => 'الرجاء تحديد نطاق التاريخ',
            'help'                  => 'حدد نطاق التاريخ',
        ],
        'phone'                     => [
            'label'                 => 'رقم الهاتف',
            'placeholder'           => 'الرجاء إدخال رقم الهاتف',
            'help'                  => 'أدخل رقم الهاتف',
        ],
    ],

    'role_crud'                     => [
        'code'                      => [
            'label'                 => 'الرمز',
            'placeholder'           => 'الرجاء إدخال الرمز',
            'help'                  => 'يجب أن يكون الرمز فريدًا ويحتوي فقط على الحروف الكبيرة والشرطات السفلية. مثل: ADMIN, CUSTOMER_SERVICE',
        ],
    ],

    'permission_crud'               => [
        'permission_type'           => [
            'label'                 => 'نوع الصلاحية',
            'placeholder'           => 'الرجاء تحديد نوع الصلاحية',
            'help'                  => 'حدد نوع الصلاحية',
            'data'                  => [
                'group_permission'  => 'مجموعة صلاحيات (CRUD)',
                'sigle_permission'  => 'صلاحية مفردة (غير CRUD)',
            ],
        ],
        'permission_group'          => [
            'label'                 => 'مجموعة الصلاحية',
            'placeholder'           => 'الرجاء تحديد مجموعة الصلاحية',
            'help'                  => 'الرجاء تحديد مجموعة الصلاحية لإضافة الصلاحية (مطلوب)',
        ],
        'permission_name'           => [
            'label'                 => 'اسم الصلاحية',
            'placeholder'           => 'الرجاء إدخال اسم الصلاحية',
            'help'                  => 'أدخل اسم الصلاحية (مطلوب)',
        ],
        'code'                      => [
            'label'                 => 'الرمز',
            'placeholder'           => 'الرجاء إدخال الرمز',
            'help'                  => 'يجب أن يكون الرمز فريدًا ويحتوي فقط على الحروف الكبيرة والشرطات السفلية. مثل: CONTENT, USER_MANAGEMENT',
        ],
        'icon'                      => [
            'label'                 => 'الأيقونة',
            'placeholder'           => 'الرجاء إدخال الأيقونة',
            'help'                  => 'اسم فئة أيقونة الخط الرهيبة. مثال: fas fa-user, fas fa-cogs',
        ],
    ],

    'country_crud'                  => [
        'native_name'               => [
            'label'                 => 'الاسم الأصلي',
            'placeholder'           => 'الرجاء إدخال الاسم الأصلي',
            'help'                  => 'أدخل الاسم الأصلي (مطلوب)',
        ],
        'iso2'                      => [
            'label'                 => 'ISO2',
            'placeholder'           => 'الرجاء إدخال ISO2',
            'help'                  => 'أدخل ISO2 (مطلوب)',
        ],
        'iso3'                      => [
            'label'                 => 'ISO3',
            'placeholder'           => 'الرجاء إدخال ISO3',
            'help'                  => 'أدخل ISO3 (مطلوب)',
        ],
        'phone_code'                => [
            'label'                 => 'رمز الدولة',
            'placeholder'           => 'الرجاء إدخال رمز الدولة',
            'help'                  => 'أدخل رمز الدولة (مطلوب)',
        ],
        'currency'                  => [
            'label'                 => 'العملة',
            'placeholder'           => 'الرجاء إدخال العملة',
            'help'                  => 'أدخل العملة (مطلوب)',
        ],
        'currency_symbol'           => [
            'label'                 => 'رمز العملة',
            'placeholder'           => 'الرجاء إدخال رمز العملة',
            'help'                  => 'أدخل رمز العملة (مطلوب)',
        ],
        'lat'                       => [
            'label'                 => 'خط العرض',
            'placeholder'           => 'الرجاء إدخال خط العرض',
            'help'                  => 'أدخل خط العرض (مطلوب)',
        ],
        'lng'                       => [
            'label'                 => 'خط الطول',
            'placeholder'           => 'الرجاء إدخال خط الطول',
            'help'                  => 'أدخل خط الطول (مطلوب)',
        ],
    ],

    'admin_crud'                    => [
        'full_name'                 => [
            'label'                 => 'الاسم الكامل',
            'placeholder'           => 'الرجاء إدخال الاسم الكامل',
            'help'                  => 'أدخل الاسم الكامل (مطلوب)',
        ],
        'username'                  => [
            'label'                 => 'اسم المستخدم',
            'placeholder'           => 'الرجاء إدخال اسم المستخدم',
            'help'                  => 'يجب أن يكون اسم المستخدم فريدًا ويحتوي فقط على الحروف الإنجليزية والأرقام والشرطات السفلية. مثال: john_doe',
        ],
        'phone_number'              => [
            'label'                 => 'رقم الهاتف',
            'placeholder'           => 'رقم الهاتف',
            'help'                  => 'أدخل رقم الهاتف',
        ],
        'avatar'                    => [
            'label'                 => 'الصورة الرمزية',
            'placeholder'           => 'الرجاء تحديد صورة رمزية',
            'help'                  => 'حدد صورة رمزية',
            'subText'               => 'الانواع المسموح بها : :types والحجم الأقصى : :size MB',
        ],
        'gender'                    => [
            'label'                 => 'الجنس',
            'placeholder'           => 'الرجاء تحديد الجنس',
            'help'                  => 'حدد الجنس (مطلوب)',
        ],
    ],

    'setting_crud'                  => [
        'group'                     => [
            'label'                 => 'مجموعة',
            'placeholder'           => 'يرجى اختيار مجموعة',
            'help'                  => 'اختر مجموعة (مطلوب)',
        ],
        'type'                      => [
            'label'                 => 'نوع',
            'placeholder'           => 'يرجى اختيار نوع',
            'help'                  => 'اختر نوعًا (مطلوب)',
        ],
        'key'                       => [
            'label'                 => 'مفتاح',
            'placeholder'           => 'يرجى إدخال مفتاح',
            'help'                  => 'يجب أن يكون المفتاح فريدًا ويحتوي فقط على أحرف صغيرة وأرقام وتسطير أسفل. مثال: site_title, site_description',
        ],
        'value'                     => [
            'label'                 => 'قيمة',
            'placeholder'           => 'يرجى إدخال قيمة',
            'help'                  => 'أدخل قيمة (مطلوب)',
        ],
        'options'                   => [
            'label'                 => 'خيارات',
            'placeholder'           => 'يرجى إدخال الخيارات',
            'help'                  => 'ادخل الخيارات بتنسيق JSON. مثال: {"key": "value"}. هذا الحقل مطلوب لنوع التحديد',
        ],
        'order'                     => [
            'label'                 => 'ترتيب',
            'placeholder'           => 'يرجى إدخال ترتيب',
            'help'                  => 'أدخل ترتيبًا (مطلوب)',
        ],
        'is_required'               => [
            'label'                 => 'هل هو مطلوب',
            'placeholder'           => 'يرجى اختيار المطلوب',
            'help'                  => 'اختر المطلوب',
        ],
        'translatable'              => [
            'label'                 => 'هل توجد ترجمة لقيمة هذا الإعداد؟',
            'placeholder'           => 'يرجى اختيار قابل للترجمة',
            'help'                  => 'اختر قابل للترجمة (مطلوب)',
        ],
        'trans_value'               => [
            'label'                 => 'قيمة الترجمة [:locale]',
            'placeholder'           => 'يرجى إدخال قيمة الترجمة',
            'help'                  => 'أدخل قيمة الترجمة',
        ],
    ],

    'content_category_crud'         => [
        'slug'                      => [
            'label'                 => 'الاسم الظاهر',
            'placeholder'           => 'الرجاء إدخال الاسم الظاهر',
            'help'                  => 'يستخدم الاسم الظاهر في الروابط والعناوين. لا يمكنك تعديله بعد الحفظ',
            'subText'               => 'يجب أن يكون الاسم الظاهر فريدًا ويحتوي فقط على الحروف الإنجليزية والشرطات العلوية. مثال: news, articles',
        ],
        'parent'                    => [
            'label'                 => 'التصنيف الاب',
            'placeholder'           => 'الرجاء تحديد التصنيف الاب (اختياري)',
            'help'                  => 'حدد التصنيف الاب (اختياري)',
        ],
        'can_be_deleted'            => [
            'label'                 => 'يمكن حذفه',
            'placeholder'           => 'الرجاء تحديد إمكانية الحذف',
            'help'                  => 'حدد إمكانية الحذف',
        ],
    ],

    'contents_crud'                 => [
        'published_at'              => [
            'label'                 => 'تاريخ النشر',
            'placeholder'           => 'الرجاء تحديد تاريخ النشر',
            'help'                  => 'حدد تاريخ النشر (مطلوب)',
        ],
        'image'                     => [
            'label'                 => 'صورة المحتوى [:locale]',
            'help'                  => 'يفضل ان تكون أبعاد الصور : :dimenstions ونوع الصورة : :types',
            'subText'               => 'يفضل ان تكون أبعاد الصور : :dimenstions ونوع الصورة : :types',
            'placeholder'           => '',
        ],
        'slug'                      => [
            'label'                 => 'الاسم الظاهر',
            'placeholder'           => 'الرجاء إدخال الاسم الظاهر',
            'help'                  => 'يستخدم الاسم الظاهر في الروابط والعناوين. لا يمكنك تعديله بعد الحفظ',
            'subText'               => 'يجب أن يكون الاسم الظاهر فريدًا ويحتوي فقط على الحروف الإنجليزية والشرطات العلوية. مثال: news, articles',
        ],
        'sliders'                   => [
            'placement'             => [
                'label'             => 'مكان العرض',
                'placeholder'       => 'الرجاء تحديد مكان العرض',
                'help'              => 'حدد مكان العرض (مطلوب)',
            ],
            'link'                  => [
                'label'             => 'الرابط',
                'placeholder'       => 'https://example.com',
                'help'              => 'أدخل الرابط (اختياري)',
            ],
        ],
        'blogs'                     => [
            'tags'                  => [
                'label'             => 'الوسوم',
                'placeholder'       => 'الرجاء تحديد الوسوم',
                'help'              => 'حدد الوسوم (اختياري)',
            ],
        ],
    ],

    'category_crud'                 => [
        'image'                     => [
            'label'                 => 'صورة التصنيف',
            'help'                  => 'يفضل ان تكون أبعاد الصور : :dimenstions ونوع الصورة : :types',
            'subText'               => 'يفضل ان تكون أبعاد الصور : :dimenstions ونوع الصورة : :types',
            'placeholder'           => '',
        ],
    ],

    'user_crud'                     => [
        'first_name'                => [
            'label'                 => 'الاسم الأول',
            'placeholder'           => 'الرجاء إدخال الاسم الأول',
            'help'                  => 'أدخل الاسم الأول (مطلوب)',
        ],
        'last_name'                 => [
            'label'                 => 'الاسم الأخير',
            'placeholder'           => 'الرجاء إدخال الاسم الأخير',
            'help'                  => 'أدخل الاسم الأخير (مطلوب)',
        ],
    ],

    'notification_template_crud'    => [
        'name'                      => [
            'label'                 => 'الاسم',
            'placeholder'           => 'الرجاء إدخال الاسم',
            'help'                  => 'أدخل الاسم (مطلوب)',
            'subText'               => 'يجب أن يكون الاسم فريدًا ويحتوي فقط على الحروف الإنجليزية والأرقام والشرطات السفلية. مثال: new_user_registered, order_created',
        ],
        'channels'                  => [
            'label'                 => 'القنوات',
            'placeholder'           => 'الرجاء تحديد القنوات',
            'help'                  => 'حدد القنوات (مطلوب)',
        ],
        'variables'                 => [
            'label'                 => 'المتغيرات',
            'placeholder'           => 'الرجاء تحديد المتغيرات',
            'help'                  => 'حدد المتغيرات (مطلوب)',
            'subText'               => 'أدخل المتغيرات التي سيتم استخدامها في القالب. مثال: user_name، order_number',
        ],
        'priority'                  => [
            'label'                 => 'الأولوية',
            'placeholder'           => 'الرجاء تحديد الأولوية',
            'help'                  => 'حدد الأولوية (مطلوب)',
        ],
        'short_template'            => [
            'label'                 => 'القالب القصير',
            'placeholder'           => 'الرجاء إدخال القالب القصير',
            'help'                  => 'أدخل القالب القصير (مطلوب)',
            'subText'               => 'يتم استخدام القالب القصير للرسائل القصيرة والإشعارات الفورية.'
        ],
        'long_template'             => [
            'label'                 => 'القالب الطويل',
            'placeholder'           => 'الرجاء إدخال القالب الطويل',
            'help'                  => 'أدخل القالب الطويل (مطلوب)',
            'subText'               => 'يتم استخدام القالب الطويل للرسائل البريدية.'
        ],
    ],

    'notification_crud'             => [
        'body'                      => [
            'label'                 => 'النص',
            'placeholder'           => 'الرجاء إدخال النص',
            'help'                  => 'أدخل النص (مطلوب)',
        ],
        'link'                      => [
            'label'                 => 'الرابط',
            'placeholder'           => 'https://example.com',
            'help'                  => 'الرابط اختياري',
            'subText'               => 'رابط ليتم توجيه المستخدم إليه عند النقر على الإشعار من اجل قنوات ال fcm_web و fcm_mobile',
        ],
        'recipient'                 => [
            'label'                 => 'المستلم',
            'placeholder'           => 'الرجاء تحديد المستلم',
            'help'                  => 'حدد المستلم (مطلوب)',
        ],
        'notification_template'     => [
            'label'                 => 'قالب الإشعار',
            'placeholder'           => 'الرجاء تحديد قالب الإشعار',
            'help'                  => 'حدد قالب الإشعار (مطلوب)',
        ],
        'added_by'                  => [
            'label'                 => 'المضاف بواسطة',
            'placeholder'           => 'الرجاء تحديد المضاف بواسطة',
            'help'                  => 'حدد المضاف بواسطة (مطلوب)',
        ],
        'groups'                    => [
            'label'                 => 'المجموعات',
            'placeholder'           => 'الرجاء تحديد المجموعات',
            'help'                  => 'حدد المجموعات (مطلوب)',
        ],
        'users'                     => [
            'label'                 => 'المستخدمين',
            'placeholder'           => 'الرجاء تحديد المستخدمين',
            'help'                  => 'حدد المستخدمين',
            'subText'               => 'في حالة عدم تحديد مستخدمين، سيتم إرسال الإشعار لجميع المستخدمين في المجموعات المحددة',
        ],
        'admins'                    => [
            'label'                 => 'المشرفين',
            'placeholder'           => 'الرجاء تحديد المشرفين',
            'help'                  => 'حدد المشرفين',
            'subText'               => 'في حالة عدم تحديد مشرفين، سيتم إرسال الإشعار لجميع المشرفين',
        ],
        'channels'                  => [
            'label'                 => 'القنوات',
            'placeholder'           => 'الرجاء تحديد القنوات',
            'help'                  => 'حدد القنوات (مطلوب)',
            'subText'               => 'تنبيه: إذا اخترت FCM_MOBILE أو FCM_WEB وتريد إرسال الإشعار لجميع المستخدمين، فلا يمكنك اختيار قنوات أخرى (مثل البريد الإلكتروني أو الرسائل النصية). وذلك لأن الإشعار سيتم إرساله عبر ال Topic  الخاص بـ FCM.',
        ],
    ],

    'contactus_crud'                => [
        'first_name'                => [
            'label'                 => 'الاسم الأول',
            'placeholder'           => 'الرجاء إدخال الاسم الأول',
            'help'                  => 'أدخل الاسم الأول (مطلوب)',
        ],
        'last_name'                 => [
            'label'                 => 'الاسم الأخير',
            'placeholder'           => 'الرجاء إدخال الاسم الأخير',
            'help'                  => 'أدخل الاسم الأخير (مطلوب)',
        ],
        'message'                   => [
            'label'                 => 'الرسالة',
            'placeholder'           => 'الرجاء إدخال الرسالة',
            'help'                  => 'أدخل الرسالة (مطلوب)',
        ],
        'reply'                     => [
            'label'                 => 'الرد',
            'placeholder'           => 'الرجاء إدخال الرد',
            'help'                  => 'أدخل الرد',
        ],
        'ip_address'                => [
            'label'                 => 'عنوان IP',
            'placeholder'           => 'الرجاء إدخال عنوان IP',
            'help'                  => 'أدخل عنوان IP',
        ],
        'user_agent'                => [
            'label'                 => 'User Agent',
            'placeholder'           => 'الرجاء إدخال User Agent',
            'help'                  => 'أدخل User Agent',
        ],
        'submission_date'           => [
            'label'                 => 'تاريخ الإرسال',
            'placeholder'           => 'الرجاء تحديد تاريخ الإرسال',
            'help'                  => 'حدد تاريخ الإرسال (مطلوب)',
        ],
    ],

    'api_log_crud'                  => [
        'service_name'              => [
            'label'                 => 'اسم الخدمة',
            'placeholder'           => 'الرجاء تحديد اسم الخدمة',
            'help'                  => 'حدد اسم الخدمة (مطلوب)',
        ],
        'method'                    => [
            'label'                 => 'الطريقة',
            'placeholder'           => 'الرجاء تحديد الطريقة',
            'help'                  => 'حدد الطريقة (مطلوب)',
        ],
        'endpoint'                  => [
            'label'                 => 'النقطة النهائية',
            'placeholder'           => 'الرجاء تحديد النقطة النهائية',
            'help'                  => 'حدد النقطة النهائية (مطلوب)',
        ],
        'request'                   => [
            'label'                 => 'الطلب',
            'placeholder'           => 'الرجاء إدخال الطلب',
            'help'                  => 'أدخل الطلب (مطلوب)',
        ],
        'response'                  => [
            'label'                 => 'الاستجابة',
            'placeholder'           => 'الرجاء إدخال الاستجابة',
            'help'                  => 'أدخل الاستجابة (مطلوب)',
        ],
        'status_code'               => [
            'label'                 => 'كود الحالة',
            'placeholder'           => 'الرجاء تحديد كود الحالة',
            'help'                  => 'حدد كود الحالة (مطلوب)',
        ],
    ],

    'clinic_crud'                   => [
        'name'                      => [
            'label'                 => 'اسم العيادة',
            'placeholder'           => 'الرجاء تحديد اسم العيادة',
            'help'                  => 'حدد اسم العيادة (مطلوب)',
        ],
        'address'                   => [
            'label'                 => 'العنوان',
            'placeholder'           => 'الرجاء تحديد العنوان',
            'help'                  => 'حدد العنوان (مطلوب)',
        ],
        'phone'                     => [
            'label'                 => 'رقم الهاتف',
            'placeholder'           => 'الرجاء تحديد رقم الهاتف',
            'help'                  => 'حدد رقم الهاتف (مطلوب)',
        ],
        'state_id'                  => [
            'label'                 => 'المدينة',
            'placeholder'           => 'الرجاء تحديد المدينة',
            'help'                  => 'حدد المدينة (مطلوب)',
        ],
    ],

    'doctor_crud'                   => [
        'medical_facility'          => [
            'label'                 => 'العيادة التي ينتمي إليها الطبيب',
            'placeholder'           => 'الرجاء تحديد العيادة',
            'help'                  => 'حدد العيادة (مطلوب)',
        ],

        'medical_speciality'        => [
            'label'                 => 'التخصص الطبي',
            'placeholder'           => 'الرجاء قم بتحديد التخصص الطبي للطبيب',
            'help'                  => 'حدد التخصص الطبي (مطلوب)',
        ],
    ],

    'pharmacist_crud'               => [
        'medical_facility'          => [
            'label'                 => 'الصيدلية التي ينتمي إليها الصيدلي',
            'placeholder'           => 'الرجاء تحديد الصيدلية',
            'help'                  => 'حدد الصيدلية (مطلوب)',
        ],
    ],
];
