<?php

return [
    'notifications'                                             => 'الإشعارات',
    'mark_all_as_read'                                          => 'وضع علامة على الكل كمقروء',
    'notification_templates'                                    => [
        'welcome_in_our_platform'                               => [
            'title'                                             => 'مرحباً بك في منصة NABD',
            'description'                                       => 'هذه رسالة ترحيب للمستخدم',
            'short_template'                                    => '
                عزيزي/عزيزتي {{username}},

                نرحب بك في منصة NABD ويسعدنا انضمامك إلينا.
                تم إنشاء حسابك بنجاح، وفيما يلي بيانات الدخول الخاصة بك:

                اسم المستخدم: {{email}}

                كلمة المرور المؤقتة: <b> {{password}} </b>

                يمكنك تسجيل الدخول عبر الرابط التالي:
                🔗 {{loginUrl}}

                يرجى ملاحظة أنه يجب عليك تغيير كلمة المرور عند تسجيل الدخول لأول مرة لضمان أمان حسابك.

                نتمنى لك تجربة مميزة ومفيدة على منصتنا.
                إذا كان لديك أي استفسار، لا تتردد في التواصل مع فريق الدعم.

                مع أطيب التحيات،
                فريق NABD
            ',
            'long_template'                                    => '
                عزيزي/عزيزتي {{username}},

                نرحب بك في منصة NABD ويسعدنا انضمامك إلينا.
                تم إنشاء حسابك بنجاح، وفيما يلي بيانات الدخول الخاصة بك:

                اسم المستخدم: {{email}}

                كلمة المرور المؤقتة: {{password}}

                يمكنك تسجيل الدخول عبر الرابط التالي:
                🔗 {{loginUrl}}

                يرجى ملاحظة أنه يجب عليك تغيير كلمة المرور عند تسجيل الدخول لأول مرة لضمان أمان حسابك.

                نتمنى لك تجربة مميزة ومفيدة على منصتنا.
                إذا كان لديك أي استفسار، لا تتردد في التواصل مع فريق الدعم.

                مع أطيب التحيات،
                فريق NABD
            ',
        ],
        'priority'                                              => [
            'low'                                               => 'منخفض',
            'medium'                                            => 'متوسط',
            'high'                                              => 'عالي',
            'default'                                           => 'افتراضي',
        ],
    ],
    'statuses'                                                  => [
        'delivered'                                             => 'تم الإستلام',
        'pending'                                               => 'قيد الإنتظار',
        'seen'                                                  => 'تمت مشاهدته',
        'failed'                                                => 'فشل',
        'read'                                                  => 'تمت القراءة',
    ],
    'added_by'                                                  => [
        'system'                                                => 'النظام',
        'admin'                                                 => 'المشرف',
    ],
];
